TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g352x.h
/* IOMUX_PINCM42[PF] Bits */
#define IOMUX_PINCM42_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM42_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM42_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM42_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM42_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM43[PF] Bits */
#define IOMUX_PINCM43_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM43_PF_GPIOB_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM43_PF_UART7_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM43_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM43_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM43_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000007)
#define IOMUX_PINCM43_PF_UART4_TX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM43_PF_TIMG14_CCP2                  ((uint32_t)0X00000009)
#define IOMUX_PINCM43_PF_TIMA1_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM44[PF] Bits */
#define IOMUX_PINCM44_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM44_PF_GPIOB_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM44_PF_UART7_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM44_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM44_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM44_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000007)
#define IOMUX_PINCM44_PF_UART4_RX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM44_PF_TIMG14_CCP3                  ((uint32_t)0X00000009)
#define IOMUX_PINCM44_PF_TIMA1_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM45_PF_UART0_CTS                    ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_COMP2_OUT                    ((uint32_t)0X00000006)
#define IOMUX_PINCM45_PF_TIMG8_IDX                    ((uint32_t)0X00000007)
#define IOMUX_PINCM45_PF_UART7_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM45_PF_UART4_CTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM45_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X0000000A)
#define IOMUX_PINCM45_PF_TIMG7_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM46[PF] Bits */
#define IOMUX_PINCM46_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM46_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM46_PF_UART7_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM46_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM46_PF_UART1_CTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM46_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM46_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000007)
#define IOMUX_PINCM46_PF_UART7_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM46_PF_UART4_RTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM46_PF_TIMG8_CCP0                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM46_PF_TIMG6_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM47[PF] Bits */
#define IOMUX_PINCM47_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM47_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM47_PF_UART7_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM47_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM47_PF_UART1_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM47_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM47_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM47_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000008)
#define IOMUX_PINCM47_PF_I2C0_SCL                     ((uint32_t)0X00000009)
#define IOMUX_PINCM47_PF_TIMG8_CCP1                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM47_PF_TIMG6_CCP1                   ((uint32_t)0X0000000C)

/* IOMUX_PINCM48[PF] Bits */
#define IOMUX_PINCM48_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM48_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM48_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000002)
#define IOMUX_PINCM48_PF_SPI1_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM48_PF_TIMG12_CCP0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM48_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM48_PF_TIMA_FAULT1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM48_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM48_PF_UART7_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM48_PF_I2C0_SDA                     ((uint32_t)0X00000009)
#define IOMUX_PINCM48_PF_TIMA1_CCP1_CMPL              ((uint32_t)0X0000000A)

/* IOMUX_PINCM49[PF] Bits */
#define IOMUX_PINCM49_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM49_PF_GPIOB_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM49_PF_UART4_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM49_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM49_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM49_PF_TIMG8_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM49_PF_UART1_TX                     ((uint32_t)0X00000006)
#define IOMUX_PINCM49_PF_CANFD1_CANTX                 ((uint32_t)0X00000007)
#define IOMUX_PINCM49_PF_UART6_RX                     ((uint32_t)0X00000009)

/* IOMUX_PINCM50[PF] Bits */
#define IOMUX_PINCM50_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM50_PF_GPIOB_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM50_PF_UART4_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM50_PF_SPI1_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM50_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM50_PF_TIMG8_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM50_PF_UART1_RX                     ((uint32_t)0X00000006)
#define IOMUX_PINCM50_PF_CANFD1_CANRX                 ((uint32_t)0X00000007)
#define IOMUX_PINCM50_PF_UART6_TX                     ((uint32_t)0X00000009)

