TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g352x.h
/* IOMUX_PINCM51[PF] Bits */
#define IOMUX_PINCM51_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM51_PF_GPIOB_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM51_PF_UART1_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM51_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM51_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM51_PF_COMP0_OUT                    ((uint32_t)0X00000005)
#define IOMUX_PINCM51_PF_UART6_CTS                    ((uint32_t)0X00000009)

/* IOMUX_PINCM52[PF] Bits */
#define IOMUX_PINCM52_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM52_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM52_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000002)
#define IOMUX_PINCM52_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM52_PF_TIMG12_CCP1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM52_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM52_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM52_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000007)
#define IOMUX_PINCM52_PF_UART7_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM52_PF_UART6_RTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM52_PF_TIMA1_CCP0_CMPL              ((uint32_t)0X0000000A)

/* IOMUX_PINCM53[PF] Bits */
#define IOMUX_PINCM53_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM53_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM53_PF_UART7_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM53_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM53_PF_I2C2_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM53_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM53_PF_TIMG8_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM53_PF_UART3_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM53_PF_TIMG0_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM53_PF_SPI1_CS1_POCI1               ((uint32_t)0X0000000A)
#define IOMUX_PINCM53_PF_TIMG7_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM54[PF] Bits */
#define IOMUX_PINCM54_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM54_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM54_PF_UART7_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM54_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM54_PF_I2C2_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM54_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM54_PF_TIMG8_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM54_PF_TIMA1_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM54_PF_UART3_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM54_PF_TIMG0_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM54_PF_SPI1_CS2_POCI2               ((uint32_t)0X0000000A)
#define IOMUX_PINCM54_PF_TIMG7_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM55[PF] Bits */
#define IOMUX_PINCM55_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM55_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM55_PF_UART3_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM55_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM55_PF_TIMG12_CCP1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM55_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM55_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM55_PF_UART7_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM55_PF_UART3_TX                     ((uint32_t)0X00000009)

/* IOMUX_PINCM56[PF] Bits */
#define IOMUX_PINCM56_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM56_PF_GPIOB_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM56_PF_UART0_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM56_PF_SPI0_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM56_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM56_PF_TIMA_FAULT1                  ((uint32_t)0X00000005)
#define IOMUX_PINCM56_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)
#define IOMUX_PINCM56_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM56_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000008)

/* IOMUX_PINCM57[PF] Bits */
#define IOMUX_PINCM57_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM57_PF_GPIOB_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM57_PF_UART0_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM57_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM57_PF_TIMA0_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM57_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM57_PF_COMP0_OUT                    ((uint32_t)0X00000007)
#define IOMUX_PINCM57_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000008)
#define IOMUX_PINCM57_PF_TIMA1_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM57_PF_TIMG6_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM58[PF] Bits */
#define IOMUX_PINCM58_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM58_PF_GPIOB_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM58_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM58_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM58_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000004)
#define IOMUX_PINCM58_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM58_PF_COMP2_OUT                    ((uint32_t)0X00000006)
#define IOMUX_PINCM58_PF_TIMA1_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM58_PF_TIMG6_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM59[PF] Bits */
#define IOMUX_PINCM59_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM59_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM59_PF_UART3_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM59_PF_SPI1_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM59_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM59_PF_TIMA_FAULT0                  ((uint32_t)0X00000005)
#define IOMUX_PINCM59_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM59_PF_UART7_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM59_PF_UART3_RX                     ((uint32_t)0X00000009)
#define IOMUX_PINCM59_PF_CANFD0_CANTX                 ((uint32_t)0X0000000A)
#define IOMUX_PINCM59_PF_TIMG7_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM60[PF] Bits */
#define IOMUX_PINCM60_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM60_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM60_PF_UART3_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM60_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM60_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM60_PF_TIMA_FAULT2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM60_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM60_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM60_PF_COMP0_OUT                    ((uint32_t)0X00000009)
#define IOMUX_PINCM60_PF_CANFD0_CANRX                 ((uint32_t)0X0000000A)
#define IOMUX_PINCM60_PF_TIMG7_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM61[PF] Bits */
#define IOMUX_PINCM61_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM61_PF_GPIOC_DIO12                  ((uint32_t)0X00000001)

/* IOMUX_PINCM62[PF] Bits */
#define IOMUX_PINCM62_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM62_PF_GPIOC_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM62_PF_SPI2_PICO                    ((uint32_t)0X0000000C)

